Results/Verifications/S2427/bottleneck-determination/read_only/threads-4/sysbench.log
$ time sysbench --config-file=sysbench.conf --threads=4 oltp_read_only --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-type=u
niform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 67.97 qps: 1092.88 (r/w/o: 956.55/0.00/136.34) lat (ms,95%): 66.84 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 68.23 qps: 1089.91 (r/w/o: 953.46/0.00/136.45) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 69.08 qps: 1104.53 (r/w/o: 966.37/0.00/138.15) lat (ms,95%): 66.84 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 68.10 qps: 1091.79 (r/w/o: 955.59/0.00/136.20) lat (ms,95%): 68.05 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 68.50 qps: 1095.78 (r/w/o: 958.78/0.00/137.00) lat (ms,95%): 66.84 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 68.00 qps: 1087.51 (r/w/o: 951.51/0.00/136.00) lat (ms,95%): 69.29 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4 tps: 68.80 qps: 1099.93 (r/w/o: 962.33/0.00/137.60) lat (ms,95%): 66.84 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4 tps: 68.20 qps: 1090.86 (r/w/o: 954.56/0.00/136.29) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 68.90 qps: 1103.40 (r/w/o: 965.50/0.00/137.90) lat (ms,95%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 4 tps: 67.90 qps: 1085.60 (r/w/o: 949.80/0.00/135.80) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            95774
        write:                           0
        other:                           13682
        total:                           109456
    transactions:                        6841   (68.37 per sec.)
    queries:                             109456 (1093.87 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0584s
    total number of events:              6841

Latency (ms):
         min:                                   46.07
         avg:                                   58.49
         max:                                  111.18
         95th percentile:                       68.05
         sum:                               400116.03

Threads fairness:
    events (avg/stddev):           1710.2500/2.28
    execution time (avg/stddev):   100.0290/0.01


real    1m40.304s
user    0m4.663s
sys     0m7.098s